# eleman islemleri

In [6]:
import numpy as np
import pandas as pd

In [2]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [3]:
sozluk={"x1":s1,"x2":s2,"x3":s3}

In [4]:
sozluk

{'x1': array([6, 9, 4, 3, 2]),
 'x2': array([3, 5, 1, 7, 9]),
 'x3': array([9, 7, 8, 8, 1])}

In [7]:
df=pd.DataFrame(sozluk)

In [8]:
df

   x1  x2  x3
0   6   3   9
1   9   5   7
2   4   1   8
3   3   7   8
4   2   9   1

In [9]:
df[:2]

   x1  x2  x3
0   6   3   9
1   9   5   7

In [10]:
df.index=["a","b","c","d","e"]

In [11]:
df

   x1  x2  x3
a   6   3   9
b   9   5   7
c   4   1   8
d   3   7   8
e   2   9   1

In [12]:
df["b":"d"]

   x1  x2  x3
b   9   5   7
c   4   1   8
d   3   7   8

In [13]:
# silme islemi

In [14]:
df.drop("a",axis=0)

   x1  x2  x3
b   9   5   7
c   4   1   8
d   3   7   8
e   2   9   1

In [15]:
df

   x1  x2  x3
a   6   3   9
b   9   5   7
c   4   1   8
d   3   7   8
e   2   9   1

In [17]:
df.drop("a",axis=0,inplace=True)
#kalici olarak siler

In [18]:
df

   x1  x2  x3
b   9   5   7
c   4   1   8
d   3   7   8
e   2   9   1

In [19]:
l=["c","d"]

In [20]:
df.drop(l,axis=0)

   x1  x2  x3
b   9   5   7
e   2   9   1

In [21]:
#degiskenler

In [22]:
v=["x1","x4","x2"]

In [24]:
for i in v:
    print(i in df)

True
False
True

In [25]:
"x1" in df

True

In [27]:
df["x4"]=df["x3"]/df["x2"]

In [28]:
df

   x1  x2  x3        x4
b   9   5   7  1.400000
c   4   1   8  8.000000
d   3   7   8  1.142857
e   2   9   1  0.111111

In [29]:
# degisken silme

In [31]:
df.drop("x4",axis=1,inplace=True)

In [32]:
df

   x1  x2  x3
b   9   5   7
c   4   1   8
d   3   7   8
e   2   9   1

In [33]:
z=["x1","x2"]

In [34]:
df.drop(z,axis=1)

   x3
b   7
c   8
d   8
e   1

In [35]:
df

   x1  x2  x3
b   9   5   7
c   4   1   8
d   3   7   8
e   2   9   1